RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_generator_v3.c
    /* Set the scanning mode */
    #if (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE)
        ptrBaseCfg->ctl |= CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN << MSC_CTL_OPERATING_MODE_Pos;
    #endif /* (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE) */

    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
        ptrBaseCfg->swSelGpio = 0u;
    #endif

    /* Frame is not started */
    ptrBaseCfg->frameCmd = 0x00u;

    /* Clear Structures */
    (void)memset(&ptrBaseCfg->sensorConfig, 0, sizeof(cy_stc_msc_sensor_config_t));
    (void)memset(&ptrBaseCfg->swSelCsw[0u], 0, CY_MSC_CSW_NUM * CY_CAPSENSE_BYTE_IN_32_BIT);
    (void)memset(&ptrBaseCfg->mode, 0, sizeof(cy_stc_msc_mode_config_t) * CY_MSC_MODES_NUM);

    /*
     * MODE CONFIGURATION
     */
    idCounter = 0u;
    ptrMapping = &ptrIntrCxt->mapSenseMethod[0u];
    for (i = 0u; i < CY_CAPSENSE_REG_MODE_NUMBER; i++)
    {
        ptrMapping[i] = CY_CAPSENSE_REG_MODE_UNDEFINED;
    }
    if (0u == context->ptrCommonConfig->numWd)
    {
        capStatus |= CY_CAPSENSE_STATUS_BAD_CONFIG;
    }
    /* For each widget */
    for (i = 0u; i < context->ptrCommonConfig->numWd; i++)
    {
        cdacDitherEnabled = context->ptrWdContext[i].cdacDitherEn;

        /* Calculate REG_MODE value */
        snsMethod = context->ptrWdConfig[i].senseMethod;
        snsMethodInternal = snsMethod - 1u;

        if (CY_CAPSENSE_ENABLE == cdacDitherEnabled)
        {
            /* Shift sense mode to cdac dither enabled modes */
            snsMethodInternal += CY_CAPSENSE_REG_MODE_DITHERING;
        }

        /* If a method is a new method then register the method */
        if (ptrMapping[snsMethodInternal] == CY_CAPSENSE_REG_MODE_UNDEFINED)
        {
            if (CY_MSC_SENSE_MODE_NUMBER < idCounter)
            {
                capStatus |= CY_CAPSENSE_STATUS_CONFIG_OVERFLOW;
                break;
            }
            else
            {
                ptrMapping[snsMethodInternal] = (uint8_t)idCounter;
                ptrBaseCfg->mode[idCounter] = ptrTemplateCfg->mode[snsMethodInternal];

                #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
                        if(CY_CAPSENSE_CSX_GROUP == snsMethod)
                        {
                            ptrBaseCfg->mode[idCounter].senseDutyCtl = CY_CAPSENSE_FW_CSX_AMUX_MODE_SENSE_DUTY_CTL_VALUE;
                        }
                    #endif
                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
                        if(CY_CAPSENSE_CSD_GROUP == snsMethod)
                        {
                            ptrBaseCfg->mode[idCounter].senseDutyCtl = 0u;
                        }
                    #endif
                #endif

                if((CY_CAPSENSE_MSC0_CMOD1PADD_PIN != ptrMscChConfig->pinCmod1) &&
                   (CY_CAPSENSE_MSC1_CMOD1PADD_PIN != ptrMscChConfig->pinCmod1))
                {
                    ptrBaseCfg->mode[idCounter].swSelComp &= (~MSC_MODE_SW_SEL_COMP_CPCS1_Msk);
                    ptrBaseCfg->mode[idCounter].swSelComp &= (~MSC_MODE_SW_SEL_COMP_CMCS2_Msk);
                    ptrBaseCfg->mode[idCounter].swSelComp |= MSC_MODE_SW_SEL_COMP_CPCS3_Msk;
                    ptrBaseCfg->mode[idCounter].swSelComp |= MSC_MODE_SW_SEL_COMP_CMCS4_Msk;

                    ptrBaseCfg->mode[idCounter].swSelSh &= (~MSC_MODE_SW_SEL_SH_C1SHG_Msk);
                    ptrBaseCfg->mode[idCounter].swSelSh |= MSC_MODE_SW_SEL_SH_C3SHG_Msk;
                }

                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
                    if(CY_CAPSENSE_CSX_GROUP == snsMethod)
                    {
                        #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
                            ptrBaseCfg->mode[idCounter].swSelTop = CY_CAPSENSE_CSX_FW_AMUX_MODE_SW_SEL_TOP_VALUE;
                        #else
                            ptrBaseCfg->mode[idCounter].swSelTop = CY_CAPSENSE_CSX_FW_CTLMUX_MODE_SW_SEL_TOP_VALUE;
                        #endif

                        if(CY_CAPSENSE_SNS_CONNECTION_VDDA_BY_2 == ptrIntrCxt->intrCsxInactSnsConn)
                        {
                            /* Close the reference to filter switch */
                            ptrBaseCfg->mode[idCounter].swSelTop |= MSC_MODE_SW_SEL_TOP_RMF_Msk;
                            #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
                                ptrBaseCfg->mode[idCounter].swSelSh = CY_CAPSENSE_FW_CSX_VDDA2_AMUX_MODE_SW_SEL_SH_VALUE;
                            #else
                                ptrBaseCfg->mode[idCounter].swSelSh = CY_CAPSENSE_FW_CSX_VDDA2_CTLMUX_MODE_SW_SEL_SH_VALUE;
                            #endif
                        }
                    }
                #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) */

                idCounter++;
            }
        }
    }
    ptrIntrCxt->numSenseMethod = (uint8_t)idCounter;

    /*
     * PINS CONFIGURATION
     */
    for (i = 0u; i < CY_CAPSENSE_CTRLMUX_PIN_STATE_NUMBER; i++)
    {
        ptrBaseCfg->swSelCswFunc[i] = ptrTemplateCfg->swSelCswFunc[i];
    }

    #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) &&\
         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN))
        if (CY_CAPSENSE_SHIELD_PASSIVE == context->ptrCommonConfig->csdShieldMode)
        {
            ptrBaseCfg->swSelCswFunc[CY_CAPSENSE_CTRLMUX_PIN_STATE_SHIELD] =
                    CY_CAPSENSE_FW_SHIELD_PASSIVE_CTRLMUX_REG_SW_SEL_CSW_VALUE;
        }
    #endif

    /*
     * CONFIGURATION FROM CAPSENSE&trade; DATA STRUCTURE
     */

    /* Initialize interrupts for all enabled MSC channels */
    #if (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE)
        ptrBaseCfg->intrMask |= MSC_INTR_MASK_FRAME_Msk;
    #else
        ptrBaseCfg->intrMask |= MSC_INTR_MASK_SCAN_Msk;
    #endif /* (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE) */

    /* Shielding is available in CSD only */
    #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) &&\
         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN))
        if(CY_CAPSENSE_REG_MODE_UNDEFINED != ptrMapping[CY_CAPSENSE_REG_MODE_CSD])
        {
            ptrBaseCfgMode = &ptrBaseCfg->mode[ptrMapping[CY_CAPSENSE_REG_MODE_CSD]];
            Cy_CapSense_ApplyShieldConfig(ptrBaseCfgMode, context);
        }

        if(CY_CAPSENSE_REG_MODE_UNDEFINED != ptrMapping[CY_CAPSENSE_REG_MODE_CSD_DITHERING])
        {
            ptrBaseCfgMode = &ptrBaseCfg->mode[ptrMapping[CY_CAPSENSE_REG_MODE_CSD_DITHERING]];
            Cy_CapSense_ApplyShieldConfig(ptrBaseCfgMode, context);
        }
    #endif

    /* Generating the common configuration for the Compensation CDAC */
    #if((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_COMP_USAGE) || \
        (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CDAC_COMP_USAGE))
        ptrBaseCfg->ccompCdacCtl |= (uint32_t)ptrIntrCxt->proOffsetCdacComp << MSC_CCOMP_CDAC_CTL_SEL_CO_PRO_OFFSET_Pos;
    #else
        ptrBaseCfg->swSelCdacCo = 0u;
    #endif

