RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_generator_v3.c
    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
        uint32_t snsMask;
        uint32_t snsMaskInactive = 0u;
        uint32_t snsFuncState;
        uint32_t snsFuncStateSelfCap;
        uint32_t snsFuncStateMutualCap;
        uint32_t snsIndex;
        uint32_t wdIndex;
        uint32_t slotValue;
        uint32_t widgetSenseGroup;
        const cy_stc_capsense_electrode_config_t * eltdPinCfg;

        #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_MULTI_PHASE_ENABLED)
            uint32_t j = 0u;
            uint32_t pattern;
            uint32_t snsMaskNegative;
            uint32_t snsFuncStateNegative;
        #endif

        /* Get mask for all pins in control mux switch registers */
        snsMaskInactive = context->ptrBaseFrameContext[chId].cswCtl;

        /* Define mutual cap pin state */
        snsFuncStateMutualCap = CY_CAPSENSE_CTRLMUX_PIN_STATE_GND;
        switch (context->ptrInternalContext->intrCsxInactSnsConn)
        {
            case CY_CAPSENSE_SNS_CONNECTION_HIGHZ:
                snsFuncStateMutualCap = CY_CAPSENSE_CTRLMUX_PIN_STATE_HIGH_Z;
                break;
            case CY_CAPSENSE_SNS_CONNECTION_VDDA_BY_2:
                snsFuncStateMutualCap = CY_CAPSENSE_CTRLMUX_PIN_STATE_VDDA2;
                break;
            default:
                /* No action for other connections */
                break;
        }

        /* Define self cap pin state */
        snsFuncStateSelfCap = CY_CAPSENSE_CTRLMUX_PIN_STATE_GND;
        switch (context->ptrInternalContext->intrCsdInactSnsConn)
        {
            case CY_CAPSENSE_SNS_CONNECTION_HIGHZ:
                snsFuncStateSelfCap = CY_CAPSENSE_CTRLMUX_PIN_STATE_HIGH_Z;
                break;
            case CY_CAPSENSE_SNS_CONNECTION_SHIELD:
                snsFuncStateSelfCap = CY_CAPSENSE_CTRLMUX_PIN_STATE_SHIELD;
                break;
            default:
                /* No action for other connections */
                break;
        }
    #endif

    for (scanSlotIndex = 0u; scanSlotIndex < CY_CAPSENSE_SLOT_COUNT; scanSlotIndex++)
    {
        scanSlotIndexValid = scanSlotIndex + ((chId + context->ptrCommonConfig->channelOffset) * CY_CAPSENSE_SLOT_COUNT);
        (void)Cy_CapSense_GenerateSensorConfig((chId + context->ptrCommonConfig->channelOffset), scanSlotIndexValid, &sensorCfgTmp[0u], context);

        /* Does this for Control Mux connection only */
        #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
            slotValue = context->ptrScanSlots[scanSlotIndexValid].wdId;
            if (CY_CAPSENSE_SLOT_EMPTY == slotValue)
            {
                scanSlotIndexValid = (((chId + 1u) % CY_CAPSENSE_TOTAL_CH_NUMBER) * CY_CAPSENSE_SLOT_COUNT) +
                                     scanSlotIndex;
                wdIndex = context->ptrScanSlots[scanSlotIndexValid].wdId;
                widgetSenseGroup = context->ptrWdConfig[wdIndex].senseMethod;
                if (CY_CAPSENSE_CSD_GROUP == widgetSenseGroup)
                {
                    snsFuncState = snsFuncStateSelfCap;
                }
                else
                {
                    snsFuncState = snsFuncStateMutualCap;
                }
                /* INACTIVE SENSORS */
                Cy_CapSense_CalculateMaskRegisters(snsMaskInactive, snsFuncState, &sensorCfgTmp[0u]);
            }
            else
            {
                if (CY_CAPSENSE_SLOT_SHIELD_ONLY <= slotValue)
                {
                    scanSlotIndexValid = ((uint32_t)context->ptrScanSlots[scanSlotIndexValid].snsId *
                                          CY_CAPSENSE_SLOT_COUNT) + scanSlotIndex;
                }

                snsIndex = context->ptrScanSlots[scanSlotIndexValid].snsId;
                wdIndex = context->ptrScanSlots[scanSlotIndexValid].wdId;
                widgetSenseGroup = context->ptrWdConfig[wdIndex].senseMethod;
                snsFuncState = snsFuncStateMutualCap;
                if (CY_CAPSENSE_CSD_GROUP == widgetSenseGroup)
                {
                    snsFuncState = snsFuncStateSelfCap;
                }
                /* INACTIVE SENSORS */
                Cy_CapSense_CalculateMaskRegisters(snsMaskInactive, snsFuncState, &sensorCfgTmp[0u]);

                /* ACTIVE SELF-CAP SENSOR */
                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
                    if (CY_CAPSENSE_SLOT_SHIELD_ONLY > slotValue)
                    {
                        /* Initializes an active sensor (including ganged sensors) by SNS, RX or TX sensor state */
                        if (CY_CAPSENSE_CSD_GROUP == widgetSenseGroup)
                        {
                            snsMask = 0u;
                            snsFuncState = CY_CAPSENSE_CTRLMUX_PIN_STATE_SNS;
                            eltdPinCfg = &context->ptrWdConfig[wdIndex].ptrEltdConfig[snsIndex];
                            /* Proceed only if electrode configuration belongs to selected channel */
                            if ((chId + context->ptrCommonConfig->channelOffset) == eltdPinCfg->chId)
                            {
                                /* Loop through all pads for this electrode (ganged sensor) */
                                for (i = 0u; i < eltdPinCfg->numPins; i++)
                                {
                                    snsMask |= 0x01uL << eltdPinCfg->ptrPin[i].padNumber;
                                }
                                Cy_CapSense_CalculateMaskRegisters(snsMask, snsFuncState, &sensorCfgTmp[0u]);
                            }
                        }
                    }
                #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) */

                /* ACTIVE MUTUAL-CAP SENSOR */
                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
                    if (CY_CAPSENSE_CSX_GROUP == widgetSenseGroup)
                    {
                        if (CY_CAPSENSE_SLOT_SHIELD_ONLY > slotValue)
                        {
                            /* RX ELECTRODE */
                            snsMask = 0u;
                            snsFuncState = CY_CAPSENSE_CTRLMUX_PIN_STATE_RX;
                            i = snsIndex / context->ptrWdConfig[wdIndex].numRows;
                            eltdPinCfg = &context->ptrWdConfig[wdIndex].ptrEltdConfig[i];
                            if ((chId + context->ptrCommonConfig->channelOffset) == eltdPinCfg->chId)
                            {
                                /* Loop through all pads for this electrode (ganged sensor) */
                                for (i = 0u; i < eltdPinCfg->numPins; i++)
                                {
                                    snsMask |= 0x01uL << eltdPinCfg->ptrPin[i].padNumber;
                                }
                                Cy_CapSense_CalculateMaskRegisters(snsMask, snsFuncState, &sensorCfgTmp[0u]);
                            }
                        }

                        /* Handles multi-phase TX feature */
                        #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_MULTI_PHASE_ENABLED)
                            if (context->ptrWdConfig[wdIndex].mptxOrder >= CY_CAPSENSE_MPTX_MIN_ORDER)
                            {
                                /* Multiple TX ELECTRODES */
                                snsMask = 0u;
                                snsMaskNegative = 0u;
                                snsFuncState = CY_CAPSENSE_CTRLMUX_PIN_STATE_TX;
                                snsFuncStateNegative = CY_CAPSENSE_CTRLMUX_PIN_STATE_TX_NEGATIVE;
                                /* Finds the first sensor number in mptx group */
                                i = snsIndex - (snsIndex % context->ptrWdConfig[wdIndex].mptxOrder);
                                /* Finds TX electrode of the first group sensor */
                                i = context->ptrWdConfig[wdIndex].numCols + (i % context->ptrWdConfig[wdIndex].numRows);
                                eltdPinCfg = &context->ptrWdConfig[wdIndex].ptrEltdConfig[i];
                                /* Finding the right vector / pattern for mptx operation */
                                pattern = context->ptrWdConfig[wdIndex].ptrMptxTable->vector;
                                i = (snsIndex % context->ptrWdConfig[wdIndex].mptxOrder);
                                if (0u != i)
                                {
                                    pattern = (pattern >> i) | (pattern << (context->ptrWdConfig[wdIndex].mptxOrder - i));
                                }
                                if (CY_CAPSENSE_MPTX_MAX_ORDER > context->ptrWdConfig[wdIndex].mptxOrder)
                                {
                                    pattern &= (0x01uL << context->ptrWdConfig[wdIndex].mptxOrder) - 1u;
                                }
                                /* Loop through all involved mptx TX electrodes, positive and negative */
                                for (j = 0u; j < context->ptrWdConfig[wdIndex].mptxOrder; j++)
                                {
                                    if ((chId + context->ptrCommonConfig->channelOffset) == eltdPinCfg->chId)
                                    {
                                        if (0u != (pattern & 0x01u))
                                        {
                                            /* Loop through all pads for this electrode (ganged sensor) */
                                            for (i = 0u; i < eltdPinCfg->numPins; i++)
                                            {
                                                snsMask |= 0x01uL << eltdPinCfg->ptrPin[i].padNumber;
                                            }
                                        }
                                        else
                                        {
                                            /* Loop through all pads for this electrode (ganged sensor) */
                                            for (i = 0u; i < eltdPinCfg->numPins; i++)
                                            {
                                                snsMaskNegative |= 0x01uL << eltdPinCfg->ptrPin[i].padNumber;
                                            }
                                        }
                                    }
                                    pattern >>= 0x01u;
                                    eltdPinCfg++;
                                }
                                Cy_CapSense_CalculateMaskRegisters(snsMask, snsFuncState, &sensorCfgTmp[0u]);
                                Cy_CapSense_CalculateMaskRegisters(snsMaskNegative, snsFuncStateNegative, &sensorCfgTmp[0u]);
                            }
                            else
                            {
                                /* TX ELECTRODE */
                                snsMask = 0u;
                                snsFuncState = CY_CAPSENSE_CTRLMUX_PIN_STATE_TX;
                                i = context->ptrWdConfig[wdIndex].numCols +
                                        (snsIndex % context->ptrWdConfig[wdIndex].numRows);
                                eltdPinCfg = &context->ptrWdConfig[wdIndex].ptrEltdConfig[i];
                                if ((chId + context->ptrCommonConfig->channelOffset) == eltdPinCfg->chId)
                                {
                                    /* Loop through all pads for this electrode (ganged sensor) */
                                    for (i = 0u; i < eltdPinCfg->numPins; i++)
                                    {
                                        snsMask |= 0x01uL << eltdPinCfg->ptrPin[i].padNumber;
                                    }
                                    Cy_CapSense_CalculateMaskRegisters(snsMask, snsFuncState, &sensorCfgTmp[0u]);
                                }
                            }
                        #else
                            /* TX ELECTRODE */
                            snsMask = 0u;
                            snsFuncState = CY_CAPSENSE_CTRLMUX_PIN_STATE_TX;
                            i = context->ptrWdConfig[wdIndex].numCols +
                                    (snsIndex % context->ptrWdConfig[wdIndex].numRows);
                            eltdPinCfg = &context->ptrWdConfig[wdIndex].ptrEltdConfig[i];
                            if ((chId + context->ptrCommonConfig->channelOffset) == eltdPinCfg->chId)
                            {
                                /* Loop through all pads for this electrode (ganged sensor) */
                                for (i = 0u; i < eltdPinCfg->numPins; i++)
                                {
                                    snsMask |= 0x01uL << eltdPinCfg->ptrPin[i].padNumber;
                                }
                                Cy_CapSense_CalculateMaskRegisters(snsMask, snsFuncState, &sensorCfgTmp[0u]);
                            }
                        #endif
                    }
                #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) */

                /* SHIELD ELECTRODE */
                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
                    if (0u < context->ptrCommonConfig->csdShieldNumPin)
                    {
                        snsMask = 0u;
                        /* Connect shield to CSX_ISC in CSX mode */
                        snsFuncState = (CY_CAPSENSE_CSD_GROUP == widgetSenseGroup) ?
                                        CY_CAPSENSE_CTRLMUX_PIN_STATE_SHIELD :
                                        snsFuncStateMutualCap;

                        for (i = 0u; i < context->ptrCommonConfig->csdShieldNumPin; i++)
                        {
                            if ((chId + context->ptrCommonConfig->channelOffset) == context->ptrShieldPinConfig[i].chId)
                            {
                                snsMask |= 0x01uL << context->ptrShieldPinConfig[i].padNumber;
                            }
                        }
                        Cy_CapSense_CalculateMaskRegisters(snsMask, snsFuncState, &sensorCfgTmp[0u]);
                    }
                #endif
            }
        #endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD) */

        /* Store results */
        for (i = 0u; i < CY_MSC_6_SNS_REGS; i++)
        {
            ptrSensorCfgLocal[i] = sensorCfgTmp[i];
        }
        ptrSensorCfgLocal += CY_MSC_6_SNS_REGS;
    }
}


