RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_generator_v3.c
#if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
/*******************************************************************************
* Function Name: Cy_CapSense_CalculateMaskRegisters
****************************************************************************//**
*
* Calculates the mask for pins that have to be updated for Control MUX
* connection.
*
* \param mask
* Specifies the mask of pins that should be updated.
*
* \param funcState
* Specifies the pin state functionality.
*
* \param ptrCfg
* Specifies the pointer to the mask registers.
*
*******************************************************************************/
void Cy_CapSense_CalculateMaskRegisters(
                uint32_t mask,
                uint32_t funcState,
                uint32_t * ptrCfg)
{
    uint32_t * ptrCfgMask = ptrCfg;

    ptrCfgMask[0u] &= ~mask;
    ptrCfgMask[1u] &= ~mask;
    ptrCfgMask[2u] &= ~mask;
    if (0u != (funcState & 0x04u))
    {
        ptrCfgMask[0u] |= mask;
    }
    if (0u != (funcState & 0x02u))
    {
        ptrCfgMask[1u] |= mask;
    }
    if (0u != (funcState & 0x01u))
    {
        ptrCfgMask[2u] |= mask;
    }
}
#endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD) */


/*******************************************************************************
* Function Name: Cy_CapSense_GenerateCdacConfig
****************************************************************************//**
*
* Generates the Cap DAC configuration for a selected sensor.
*
* \param scanSlot
* Slot to scan
*
* \param ptrSensorCfg
* Specifies the pointer to the sensor configuration to be filled.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is performed successfully.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_GenerateCdacConfig(
                uint32_t scanSlot,
                uint32_t * ptrSensorCfg,
                const cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t capStatus = 0u;
    const cy_stc_capsense_widget_config_t * ptrWdCfg;
    const cy_stc_capsense_sensor_context_t * ptrSnsCxt;
    uint32_t compDiv;
    uint32_t wdIndex;
    uint32_t snsIndex;
    uint32_t cdacLfsrScale;
    uint32_t snsCdacCtlReg = 0u;

    wdIndex = context->ptrScanSlots[scanSlot].wdId;
    snsIndex = context->ptrScanSlots[scanSlot].snsId;
    ptrWdCfg  = &context->ptrWdConfig[wdIndex];
    ptrSnsCxt = &ptrWdCfg->ptrSnsContext[snsIndex];

    /* Compensation CDAC Divider */
    compDiv = context->ptrWdContext[wdIndex].cdacCompDivider;
    compDiv = (compDiv > 0u) ? (compDiv - 1u) : 0u;
    ptrSensorCfg[CY_CAPSENSE_SNS_SCAN_CTL_INDEX] &= ~MSC_SNS_SCAN_CTL_COMP_DIV_Msk;
    ptrSensorCfg[CY_CAPSENSE_SNS_SCAN_CTL_INDEX] |= compDiv << MSC_SNS_SCAN_CTL_COMP_DIV_Pos;

    /* Cap DAC dithering control */
    snsCdacCtlReg = 0u;

    snsCdacCtlReg |= MSC_SNS_CDAC_CTL_CLOCK_REF_RATE_Msk;

    if (CY_CAPSENSE_ENABLE == ptrWdCfg->ptrWdContext->cdacDitherEn)
    {
        cdacLfsrScale = context->ptrWdContext[wdIndex].cdacDitherValue;
        snsCdacCtlReg |= cdacLfsrScale << MSC_SNS_CDAC_CTL_LFSR_SCALE_FL_Pos;
        snsCdacCtlReg |= MSC_SNS_CDAC_CTL_FL_EN_Msk;
    }

    #if(CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
        if (0u != (CY_CAPSENSE_MW_STATE_CALIBRATION_SINGLE_MASK & context->ptrCommonContext->status))
        {
            /* If calibration, reuse compensation CDAC field as Ref CDAC in single CDAC mode */
            snsCdacCtlReg |= ((uint32_t)ptrSnsCxt->cdacComp) << MSC_SNS_CDAC_CTL_SEL_RE_Pos;
        }
        else
        {
            /* Ref CDAC Code setup */
            if ((CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod) &&
                (ptrWdCfg->numCols <= snsIndex))
            {
                snsCdacCtlReg |= ((uint32_t)ptrWdCfg->ptrWdContext->rowCdacRef) <<
                                                    MSC_SNS_CDAC_CTL_SEL_RE_Pos;
            }
            else
            {
                snsCdacCtlReg |= ((uint32_t)ptrWdCfg->ptrWdContext->cdacRef) <<
                                                    MSC_SNS_CDAC_CTL_SEL_RE_Pos;
            }

            if(((CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod) &&
                (CY_CAPSENSE_ENABLE == context->ptrCommonConfig->csdCdacCompEn)) ||
               ((CY_CAPSENSE_CSX_GROUP == ptrWdCfg->senseMethod) &&
                (CY_CAPSENSE_ENABLE == context->ptrCommonConfig->csxCdacCompEn)))
            {
                snsCdacCtlReg |= ((uint32_t)ptrSnsCxt->cdacComp) << MSC_SNS_CDAC_CTL_SEL_CO_Pos;
            }
        }
    #else
        if (0u == (CY_CAPSENSE_MW_STATE_CALIBRATION_SINGLE_MASK & context->ptrCommonContext->status))
        {
            /* Ref CDAC Code setup */
            if ((CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod) &&
                (ptrWdCfg->numCols <= snsIndex))
            {
                snsCdacCtlReg |= ((uint32_t)ptrWdCfg->ptrWdContext->rowCdacRef) <<
                                                    MSC_SNS_CDAC_CTL_SEL_RE_Pos;
            }
            else
            {
                snsCdacCtlReg |= ((uint32_t)ptrWdCfg->ptrWdContext->cdacRef) <<
                                                    MSC_SNS_CDAC_CTL_SEL_RE_Pos;
            }

            if(((CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod) &&
                (CY_CAPSENSE_ENABLE == context->ptrCommonConfig->csdCdacCompEn)) ||
               ((CY_CAPSENSE_CSX_GROUP == ptrWdCfg->senseMethod) &&
                (CY_CAPSENSE_ENABLE == context->ptrCommonConfig->csxCdacCompEn)))
            {
                snsCdacCtlReg |= ((uint32_t)ptrSnsCxt->cdacComp) << MSC_SNS_CDAC_CTL_SEL_CO_Pos;
            }
        }
    #endif

    ptrSensorCfg[CY_CAPSENSE_SNS_CDAC_CTL_INDEX] = snsCdacCtlReg;

